{
  "title": "Выделение лэйаута из дизайна (Шаг 3 процедуры проектирования 3RApp)",
  "goals": [
    "Практическое освоение выделения лэйаута из дизайна в рамках шага 3, процедуры проектирования 3RApp.",
    "Закрепление понимания структуры и логики лэйаута в React-приложениях."
  ],
  "training_topic": "Выделение лэйаута из дизайна (Шаг 3 процедуры проектирования 3RApp).",
  "required_resources": [
    "Дизайн страницы приложения (изображение)."
  ],
  "instructions": [
    "Введение в упражнение:",
    "- Цель упражнения — научиться выделять лэйаут из дизайна в рамках шага 3 процедуры проектирования 3RApp.",
    "",
    "- В книге \"Разработка фронтенд-приложений\" на странице 375 в шаге 3 прочтите \"Что понадобится\", \"На выходе\" и \"Что сделать в шаге\". Обратите внимание, мы с вами выполняем только первое действие из всех, что делаются в шаге 3.",
    "Текущий граф компонентов, где нанесены только страницы выглядит так: ",
    {
      "type": "image",
      "title": "Граф страниц сервиса \"Упражнение\"",
      "name": "1",
      "folder": "1",
      "format": "png",
      "chapter": "8.1"
    },
    "- Теперь ознакомьтесь с первым и вторым абзацами на странице 376 \"Как и в какой последовательности выделять компоненты из дизайна\"",
    "- В действиях шага 3 указано, что выделить нужно несколько видов компонентов, но мы займёмся конкретно лэйаутом. Мы потренируем выделение общих компонентов присутсвующих на всех страницах дизайна.",
    "Шаг 1. Нахождение общих элементов дизайна, которые будут расположены в лэйауте:",
    "- Взгляните на обе страницы дизайна сервиса \"Упражнение\".",
    {
      "type": "image",
      "title": "Дизайн сервиса \"Упражнение\"",
      "name": "2",
      "folder": "1",
      "chapter": "8.1"
    },
    "",
    "Шаг 2. Выделим хэдер:",
    "- На каждой странице присутствует наименование сервиса Упражнения и Профиль с изображением. Это общие элементы, которые будут расположены в хэдере и войдут в лэйаут.",
    "",
    "Шаг 3. Выделяем меню:",
    "- И на странице слева и на странице справа присутствует меню. Это динамичный компонент зависящий от состояния приложения. Выделяем отдельный компонент меню, который войдёт в лэйаут.",
    "",
    "Шаг 4. Выделяем футер:",
    "- И слева и справа футеры абсолютно идентичны. Выделяем отдельный компонент футера, который войдёт в лэйаут.",
    "",
    "Шаг 5. Наносим компонент лэйаут и выделенные дочерние компоненты лэйаута на граф компонентов:",
    "- Нарисуйте структуру приложения, используя компонент `Layout` для всех страниц. Убедитесь, что все страницы используют общий лэйаут.",
    {
      "type": "image",
      "title": "Новый граф компонентов сервиса \"Упражнение\"",
      "name": "3",
      "folder": "1",
      "format": "png",
      "chapter": "8.1"
    },    
    "",
    "Заключение:",
    "- Вы освоили навыки выделения лэйаута из дизайна в рамках шага 3 процедуры проектирования 3RApp, что позволит вам быстро понимать, какие элементы интерфейса являются общими для всех страниц приложения."
  ],
  "reflection_questions": [
    "Какие элементы интерфейса являются общими для всех страниц приложения?",
    "Как структура лэйаута влияет на организацию и читаемость кода?",
    "Какие альтернативные способы создания лэйаута существуют в React?"
  ],
  "additional_materials": [
    "Книга: Разработка фронтенд-приложений, автор Кузьмин Антон Геннадьевич, Издательство: \"Питер\", ISBN: 978-5-4461-4272-9, глава 8 \"Разработка фронтенд-приложения\"."
  ],
  "final_conclusion": [
    "Вы освоили навыки выделения лэйаута из дизайна в рамках шага 3 процедуры проектирования 3RApp, что позволит вам эффективно работать с React-приложениями и улучшать их структуру и производительность."
  ]
}