{
  "title": "Создание обработчиков событий и назначение ссылок на них в React",
  "goals": [
    "Практическое освоение создания обработчиков событий в React.",
    "Закрепление навыков работы с событиями и их обработчиками."
  ],
  "training_topic": "Работа с событиями и обработчиками в React-компонентах.",
  "required_resources": [
    "Редактор кода (VS Code, Sublime Text и т.д.).",
    "React-проект (готовое приложение или созданный вручную)."
  ],
  "instructions": [
    "Введение в упражнение:",
    "- Цель упражнения — научиться создавать обработчики событий в React и назначать ссылки на них в свойства элемента, а также изучить объекты событий.",
    "",
    "Шаг 1. Подготовьте рабочую среду:",
    "- Откройте редактор кода и создайте или откройте существующую папку с React-проектом.",
    "",
    "Шаг 2. Создание обработчиков событий для различных действий:",
    "- Создайте файл `App.js` и поместите в него следующий код компонента, начиная с объявления обработчиков событий:",
    {
      "type": "code",
      "title": "Объявление обработчиков событий",
      "code": "import React from 'react'; const App = () => { const handleClick = (event) => { console.log('Клик', event); }; const handleMouseMove = (event) => { console.log('Движение мыши', event); }; const handleMouseEnter = (event) => { console.log('Заход мыши', event); }; const handleMouseLeave = (event) => { console.log('Выход мыши', event); };"
    },
    "",
    "Шаг 3. Создание выражения return с назначением обработчиков событий:",
    "- Добавьте в компонент `App.js` следующий код для рендеринга элемента и назначения обработчиков событий:",
    {
      "type": "code",
      "title": "Создание выражения return",
      "code": "return ( <div onClick={handleClick} onMouseMove={handleMouseMove} onMouseEnter={handleMouseEnter} onMouseLeave={handleMouseLeave}> <p>Взаимодействуйте с этим элементом</p> </div> );"
    },
    "",
    {
      "type": "code",
      "title": "Закрывающая скобка и экспорт компонента",
      "code": "}; export default App;"
    },
    "",
    "Шаг 4. Запуск и просмотр результата:",
    "- Запустите проект с помощью команды `npm start` или аналогичной.",
    "- Откройте браузер и взаимодействуйте с элементом на странице, выполняя различные действия (клик, движение мыши, заход и выход мыши).",
    "",
    "Шаг 5. Изучение кода компонента и объектов событий:",
    "- Изучите код компонента и обратите внимание на то, как обработчики событий назначаются в свойства элемента.",
    "- Откройте консоль браузера и изучите объекты событий, которые были выведены при различных действиях.",
    "",
    {
      "type": "enumeration",
      "title": "Вопросы для размышления",
      "items": [
        "Какое событие вызывается первым при наведении мыши на элемент?",
        "Какое событие вызывается последним при выходе мыши из периметра элемента?",
        "Какое событие вызывается при клике на элемент?",
        "Какое событие вызывается при движении мыши над элементом?",
        "На какой объект ссылается свойство target в объектах события: клик, движение мыши, заход и выход мыши? Изучите объекты этих событий в консоли и дайте ответ."
      ]
    },
    "",
    "Заключение:",
    "- Вы освоили создание обработчиков событий в React и назначение ссылок на них в свойства элемента, а также изучили объекты событий."
  ],
  "reflection_questions": [
    "Какие события можно обрабатывать в React-компонентах?",
    "Как назначить обработчик события на элемент в React?",
    "Какие свойства объекта события могут быть полезны при обработке событий?"
  ],
  "additional_materials": [
    {
    "type": "link",
    "title": "Файлы для выполнения упражнения",
    "name": "1",
    "folder": "1",
    "chapter": "5.9"
    },    
    "Документация React: https://react.dev/reference/react-dom/events",
    "Документация MDN: https://developer.mozilla.org/ru/docs/Learn_web_development/Core/Scripting/Events#другие_концепции_событий"
  ],
  "final_conclusion": [
    "Вы освоили создание обработчиков событий в React, научились назначать ссылки на них в свойства элемента и изучили объекты событий."
  ]
}